Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/index.html.txt.tmx
Source language: en
Languages: ga

source: Membership of Dáil Eireann, including the weekly schedule of business
ga: Deantar cuir síos anseo ar cheann de thithe an Oireachtais, sé sin, Dáil Éireann

source: This document describes the role and responsibilities of the Ceann Comhairle, who is the chairperson of Dáil Eireann
ga: Déantar cur síos anseo ar ról an Cheann Chomhairle atá ina Chathaoirleach ar Dháil Éireann

source: This document describes the privileges of members of Dáil Eireann and Seanad Eireann - the two houses of the Oireachtas(the Irish parliament)
ga: Déantar cuir síos anseo ar na pribhléidí atá ag Teachtaí Dála agus ag Seanadóirí in Éirinn

source: Question time in Dáil Éireann
ga: Tráth na gceisteanna i nDáil Éireann

source: Members of parliament (TDs) can put oral and written questions to the Taoiseach and government ministers
ga: Déantar cuir síos anseo ar conas is féidir le Teachtaí Dála ceisteanna a chuir ar an Taoiseach agus ar na hAirí Rialtais

source: Work of a TD
ga: Obair na dTeachtaí Dála

source: The work of a TD (Teachta Dála) is varied and involves attending meetings, researching and examining proposed legislation and participating in Government committees
ga: Tá obair Teachta Dála ilchineálach lena náirítear freastal ag cruinnithe, taighde agus scrúdú reachtaíocht beartaithe agus glacadh páirt i gCoistí Rialtais

source: Eligibility for Membership of Dáil Eireann
ga: Intofacht mar theachta i nDáil Éireann

source: This document describes the eligibility criteria in order to qualify for membership of Dáil Eireann (house of the Irish parliament)
ga: Tá cur síos anseo ar intofacht mar theachta i nDáil Éireann

source: Registering a political party in Ireland
ga: Páirtí polaitiúil a chlárú in Eirinn

source: How to register a political party in Ireland
ga: Cén chaoi a gcláraítear páirtí polaitiúil in Éirinn

source: This document describes the circumstances in which Dáil Éireann (lower house of the Irish parliament) can be dissolved
ga: Tugann an cháipéis seo cur síos ar na cúinsí inar féidir Dáil Éireann a lánscor

source: This document describes how laws are made by the Oireachtas (the Irish parliament)
ga: Déantar cuir síos anseo ar conas a dhéanann an tOireachtas dlíthe

source: Private Members' Bills are proposals for legislation initiated by members of the Dáil or Seanad
ga: Is Billí na mBall Príobháideach iad bearta reachtúla atá tosnaithe ag Baill den Dáil nó den Seanad

source: This document describes the Seanad or Irish senate and the eligibility criteria for becoming a Senator
ga: Tá cur síos anseo ar Sheanad Éireann agus na daoine atá intofa le seasamh mar iarrthóirí don Seanad

source: The main function of Seanad Eireann is in relation to legislation
ga: Baineann príomhfheidhm Sheanad Éireann le reachtaíocht

source: What role does the Seanad have and what are its powers?
ga: Cad é ról an tSeanaid agus cad iad a gcumhachtaí?

source: Cathaoirleach of Seanad Éireann
ga: Cathaoirleach ar Seanad Éireann

source: The Cathaoirleach (or chairperson) of the Seanad has a number of powers and responsibilities
ga: Tá cur síos anseo ar ról an Cathaoirligh sa Seanad

source: Nomination of Seanad panel candidates
ga: Iarrthóirí Painéal an tSeanaid a Ainmniú

source: How candidates for the five panels that are formed in the Seanad in advance of general elections in Ireland are nominated
ga: Tá cur síos anseo ar an gcóras atá ann iarrthóirí a ainmniú don chúig painéal a chrúthaítear sa Seanad roimh ollthoghcháin

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Office of the Ombudsman
ga: Bunchearta faoi Bhunreacht na hÉireann
